#include <stdio.h>// підключаємо потрібні для роботи бібліотеки 
#include <math.h>

int main() {// Оголошення змінних
    float s, a, F; 
    printf("Введіть число s: ");// Просимо юзера ввести необхідні для роботи данні
    scanf_s("%f", &s);
    printf("Введіть число a: ");
    scanf_s("%f", &a);

    if (s < 0) {// Якщо умова виконується
        F = 2 * s + a * (s * s);// Присвоюємо змінній F значення виразу
    }
    else if (s == 0) {// Якщо попередня умова не виконується і ця умова виконується
        float expression = s + a - 15;
        if (expression >= 0) {//Перевірка чи не будуть дані під коренем не будуть від'ємні
            F = sqrt(expression) + 8 * s * a;// Присвоюємо змінній F значення виразу
        }
        else {
            printf("Неправильні дані. Неможливо обчислити квадратний корінь із від’ємного числа.\n");
            return 1;
        }
    }
    else {// Якщо попередня умова не виконується і ця умова виконується
        F = 12 - s / (2 * a - 4);// Присвоюємо змінній F значення виразу
    }

    printf("F = %f\n", F);//Виводимо результат на екра юзера

    return 0;//Кінець програми 
}
