#include <stdio.h> // Підключаємо потрібну для роботи бібліотеку 

int main() { //Оголошуємо змінні
    int a, s;
    float result;

    printf("Введіть значення a: ");// Просимо юзера ввести необхідні для роботи данні
    scanf_s("%d", &a);

    printf("Введіть значення s: ");
    scanf_s("%d", &s);

    if (s > a) {// Якщо умова виконується
        result = -a - s - 2;// Присвоюємо змінній result значення виразу
    }
    else if (s < 0) {// Якщо попередня умова не виконується і ця умова виконується
        result = s / (float)a;// Присвоюємо змінній result значення виразу
    }
    else if (s == 0) {// Якщо попередні умови не виконуються і ця умова виконується
        result = 2 * a;// Присвоюємо змінній result значення виразу
    }
    else if (a % 2 == 0 && s == 4) {// Якщо попередні умови не виконуються і ця умова виконується
        result = a / s + a * s;// Присвоюємо змінній result значення виразу
    }
    else if (a % 2 != 0 && s == 4) {// Якщо попередні умови не виконуються і ця умова виконується
        result = a - s / 2;// Присвоюємо змінній result значення виразу
    }
    else if (a >= 15 && s > 8 || s == 0) {// Якщо попередні умови не виконуються і ця умова виконується
        result = 2;// Присвоюємо змінній result значення виразу
    }
    else {//Якщо жодна з попередніх умов не виконується
        result = a / (float)s;
    }

    printf("Результат: %.2f", result);

    return 0;//Кінець програми
}
